#include "DrawMap.h"

int map[10][10] =
{
	{0, 1, 1, 1, 1, 1, 1, 1, 1, 1},
	{0, 0, 0, 0, 0, 0, 0, 0, 0, 1},
	{1, 1, 1, 1, 1, 1, 1, 0, 0, 1},
	{1, 0, 0, 0, 0, 0, 1, 1, 0, 1},
	{1, 0, 0, 0, 2, 0, 1, 1, 0, 1},
	{1, 1, 1, 1, 1, 0, 1, 1, 0, 1},
	{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
	{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
	{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
	{1, 1, 1, 1, 1, 1, 1, 1, 1, 1}
};//배열에 숫자를 이용하여 벽과, 로드지점 보석이 있는곳을 지정해둠

int playerX = 0;
int playerY = 0;


void DrawMap() {

for (int i = 0; i < MAP_HEIGHT; i++)
{
	for (int j = 0; j < MAP_WIDTH; j++)
	{
		gotoxy(j, i);
		if (map[i][j] == ROAD)// 움직일수 있는 공간
		{
			if (playerX == j && playerY == i)// 여기서 플레이어의 X,Y좌표가 같은곳은 캐릭터를 표시해줌 
			{
				printf("♠");
			}
			else
			{
				printf("■");// 움직일수 있는 공간을 칠해놈
			}
		}
		else if (map[i][j] == WALL)
		{
			printf("▨");
		}
		else if (map[i][j] == GEM)
		{
			printf("◈");
		}
	}
	printf("\n");// [i][1~10] 까지 끝낸후 아래로 내려가기위해서 사각형 모양 만들기위해
	}
}